<?php

return [

    'site_name' => 'Каталог сайтів України',

    'all_rights_reserved' => 'Всі права захищені.',

    'hosting' => 'Хостинг сайта',

    'main_menu' => [
        'home' => 'Каталог',
        'terms' => 'Правила',
        'search' => 'Пошук',
        'hosting' => 'Хостинг',
        'add' => 'Додати сайт',
    ],

    'btn' => [
        'create' => 'Створити',
        'delete' => 'Видалити',
        'delete_count' => 'Видалити %count%',
        'edit' => 'Змінити',
        'save' => 'Зберегти',
        'submit' => 'Надіслати',
        'add' => 'Додати',
        'search' => 'Пошук',
        'invoice' => 'Інвойс',
        'generate' => 'Генерувати',
    ],

    'admin_postfix' => 'Адмін',
   
    'admin' => [
        'menu' => [
            'admin' => 'Адмін',
            'home' => 'Головна',
            'categories' => 'Категорії',
            'errors' => 'Помилки',
            'settings' => 'Налаштування',
            'statistic' => 'Статистика'
        ],
        'label' => [
            'name_uk' => 'Назва (Укр)',
            'name_ua' => 'Назва (Рус)',
            'parent_id' => 'Parent Id',
            'order' => 'Порядок',
            'alias' => 'Аліас',
        ]
    ],

    'label' => [
        'name' => 'Назва сайту',
        'domain' => 'Домен',
        'email' => 'Емейл',
        'description' => 'Опис',
        'category' => 'Категорія',
        'password' => 'Пароль',
    ],

    'help_text' => [
        'domain' => 'адреса головної сторінки без https та www',
    ],

    'validator' => [
        'has_not_children' => 'Категорія не вибрана.'
    ],

    'page' => [
        'home' => [
            'title' => 'Каталог сайтів України',
            'meta' => [
                'description' => 'Каталог сайтів України. Без зворотного заслання. Зручний пошук сайтів Якісні та перевірені сайти. Додати сайт.',
                'keywords' => 'каталог сайтів, без зворотного посилання, додати сайт, каталог сайтів України, каталог українських сайтів',
            ],
            'partners' => 'Партнери',
            'new_sites' => 'Нові сайти в каталозі',
            'why_register_title' => 'Чому потрібно зареєструвати сайт у каталозі сайтів',
            'why_register_text' => '
                <p>Реєстрація вашого сайту у каталозі сайтів може бути корисним з кількох причин:</p>
                <ul>
                    <li><p>Підвищення видимості: Зареєструвавши ваш сайт у каталозі сайтів, ви зможете збільшити його видимість і привернути більше уваги аудиторії. Каталоги сайтів зазвичай організовані за тематикою або категоріями, що дозволяє користувачам, зацікавленим у певній ніші або темі, легко знайти ваш сайт.</p></li>
                    <li><p>Покращення SEO: Реєструючи ваш сайт у відомому каталозі сайтів, це може покращити ваші зусилля з оптимізації для пошукових систем (SEO). Каталоги сайтів вважаються надійними джерелами інформації, тому мати ваш сайт у каталозі може допомогти встановити ваш сайт як авторитет у вашій ніші.</p></li>
                    <li><p>Зворотні посилання (backlinks): Багато каталогів сайтів дозволяють включити зворотне посилання на ваш сайт. Зворотні посилання є важливими для SEO, оскільки вони сигналізують пошуковим системам, що інші сайти довіряють і цінують ваш контент. Зареєструвавши ваш сайт у каталозі сайтів та включивши зворотне посилання, ви можете покращити рейтинг вашого сайту у пошукових системах.</p></li>
                </ul>
                <p>Підсумовуючи, реєстрація вашого сайту у каталозі сайтів може бути корисним інструментом для підвищення видимості, покращення SEO та створення зворотних посилань. Однак важливо обирати надійні каталоги сайтів та дотримуватися їх правил реєстрації, щоб ваш сайт був внесений до каталогу точно і етично.</p>
            ',
        ],
        'terms' => [
            'title' => 'Правила',
            'meta' => [
                'description' => 'Правила використання каталогу сайтів. Вимоги до сайту Каталог сайтів України.',
                'keywords' => 'каталог сайтів, каталог сайтів України, просування сайтів, правила використання',
            ],
            'req_title' => 'Вимоги до веб-сайту',
            'req_li_1' => 'Email повинен бути дійсним.',
            'req_li_2' => 'Назва сайту повинна складатися з декількох слів і відповідати вмісту сайту.',
            'req_li_3' => 'URL адресою сайту має бути домен 1-го або 2-го рівня, в міжнародній або українській доменній зоні.',
            'req_li_4' => 'Категорія повинна відповідати вмісту сайту.',
            'req_li_5' => 'Короткий опис сайту повинен складатися з декількох пропозицій, пов\'язаних між собою за змістом, які дають уявлення про вміст сайту.',
            'req_li_6' => 'Докладний опис сайту повинен надавати докладну інформацію про сайт. Докладний опис не повинен бути продовженням короткого опису. Детальний опис можна вказати і після додавання сайту до каталогу, для цього потрібно написати листа <a href="mailto:info@catalog.org.ua">info@catalog.org.ua</a>, в якому вказати адресу сайту та текст опису.',
            'req_li_7' => 'Вміст сайту не повинен жодним чином порушувати закони України.',
            'add_title' => 'Додавання сайту в каталог',
            'add_li_1' => 'Розміщення сайту в каталозі платне і складає %price% грн. Сайт розміщується в каталозі терміном на 3 роки.',
            'add_li_2' => 'Сайт буде розглянутий і доданий до каталогу, якщо він відповідає всім вимогам.',
            'add_li_3' => 'При додаванні сайту, інформація про нього може бути змінена, для усунення граматичних помилок, неправильних категорій, помилок в URL-адресі та інше.',
            'add_li_4' => 'Інформація про сайт, який був доданий до каталогу, додається і на сторінки каталогу в <a href="https://www.facebook.com/sitescatalog">Facebook</a> та <a href= "https://twitter.com/sitescatalog">Twitter</a>.',
        ],
        'search' => [
            'title' => 'Пошук',
            'meta' => [
                'description' => 'Пошук сайту в каталозі сайтів України. Знайди сайт прямо зараз.',
                'keywords' => 'пошук сайтів, каталог сайтів, каталог сайтів україна',
            ],
            'name_or_domain' => 'назва або домен',
            'not_found' => 'Нічого не знайдено. Змініть умову пошуку.'
        ],
        'submit' => [
            'title' => 'Додавання сайту',
            'meta' => [
                'description' => 'Додати сайт до каталогу. Без зворотного заслання. Каталог сайтів України.',
                'keywords' => 'додати сайт, реєстрація сайту, каталог сайтів, каталог сайтів україна',
            ],
            'payment_alert' => 'Додовання сайту в каталог є платним та коштує %price% гривень',
        ],
        'confirmation' => [
            'title' => 'Підтвердження запиту',
            'already_confirmed' => 'Невірний код підтвердження або запит вже був підтверджений',
            'successfully_confirmed' => 'Запит на додатокня сайту в каталог успішно підтверджений.'
            . '<br>На протязі найближчого часу ваш сайт буде перевірений '
            . '<br>і у разі успішної модерації вам буде надіслано листа з реквізитами для оплати.',
        ],

        'success' => [
            'title' => 'Запит успішно надіслано',
            'text' => 'Запит на додавання сайту до каталогу успішно надіслано!'
            .'<br>На e-mail, вказаний вами має прийти лист із посиланням для підтвердження.'
            .'<br>Підтвердіть запит, перейшовши за посиланням.'
            .'<br>Непідтверджений тривалий час запит не буде розглянутий і буде видалений.',
        ],
        'admin' => [
            'home' => [
                'title' => 'Сайти',
            ],
            'categories' => [
                'title' => 'Категорії',
            ],
            'categories_create' => [
                'title' => 'Створення категорії',
                'list' => 'Категорії',
            ],
            'categories_edit' => [
                'title' => 'Зміна категорії',
                'list' => 'Категорії',
            ],
            'statistic' => [
                'title' => 'Статистика',
            ],
            'settings' => [
                'title' => 'Налаштування',
                'sitemap' => 'Sitemap',
                'creation_date' => 'Дата створення',
                'not_found' => 'не найдено',
                'link' => 'Посилання',
            ],
            'login' => [
                'title' => 'Логін',
            ],
        ],
    ],

    'emails' => [
        'confirmation' => [
            'subject' => 'Підтвердження запиту',
            'title' => 'Підтвердження запиту',
            'text' => 'Для підтвердження запиту на додавання сайту до каталогу, перейдіть за посиланням нижче',
            'button' => 'Підтвердити запит',
        ],
        'invoice' => [
            'subject' => 'Модерація пройшла успішно',
            'title' => 'Модерація пройшла успішно',
            'text' => 'Сайт <strong>%domain%</strong> успішно пройшов модерацію та готовий до додавання до каталогу.'
                        . '<br>Для додавання сайту до каталогу поповніть на <b>%price% гривень</b> номер <span style="white-space: nowrap;"> <b>%phone%</b>.</span >'
                        . '<br>Обов\'язково підтвердіть поповнення, відповівши на цей лист, вкажіть час оплати та url-адресу сайту.'
                        . '<br>Сайт буде додано до каталогу протягом 3 робочих днів після підтвердження оплати.',
        ],
        'added' => [
            'subject' => 'Сайт додано до каталогу',
            'title' => 'Сайт додано до каталогу',
            'text' => 'Сайт успішно додано до Каталогу сайтів України.',
        ],
    ]

];